# ParameterUtils Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterUtils Class
Members See Also
---
A utility class of functions related to parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static class ParameterUtils
```

Visual Basic
---
```text
Public NotInheritable Class ParameterUtils
```

Visual C++
---
```text
public ref class ParameterUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ParameterUtils
# See Also
ParameterUtils Members
Autodesk.Revit.DB Namespace